Конфигурация/InformationRegisters/ОценкиПодготовленностиПоТемам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОценкиПодготовленностиПоТемам</Name>
			<Comment>Срез последних оценок θ обучающихся по темам. Периодический по секунде.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/БаллыОпыта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>БаллыОпыта</Name>
			<Comment>Оборотный регистр накопления баллов опыта обучающихся.</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеБаллов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаБейджа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныНачисленияБаллов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РейтинговыеПозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РейтинговыеПозиции</Name>
			<Comment>Снимок рейтинга обучающихся в учебных группах. Периодический по дню.</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ранг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяТета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СобытияАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияАналитики</Name>
			<Comment>Лог событий пользователей для построения аналитических отчетов.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолезнаяНагрузка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеБаллов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаБейджа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийАналитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСобытия</Name>
					<Comment>Уникальный ключ записи - разводит события с одинаковыми период/пользователь/тема/тип в пределах одной секунды.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/ВыдачаБейджа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыдачаБейджа</Name>
			<Comment>Хозяйственная операция выдачи бейджа обучающемуся</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бейдж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бейджи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БаллыОпыта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ПопыткаТеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПопыткаТеста</Name>
			<Comment>Сессия адаптивного тестирования с пошаговой историей ответов</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяОценкаТета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяSE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоЗаданий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерШага</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТестовыеЗадания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Верно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяОценкаТета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяSE</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/УчебныеГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УчебныеГруппы</Name>
			<Comment>Учебные группы обучающихся</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодНабора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/ДанныеДашборда/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Формирует JSON-данные для дашборда обучающегося:
// баллы, бейджи, прогресс по траектории, рейтинг, динамика θ.
//
// Параметры:
//  Пользователь - Строка    - ФИО обучающегося.
//  Период       - Структура - Начало (Дата), Окончание (Дата) — период аналитики.
//
// Возвращаемое значение:
//  Строка - JSON-представление данных дашборда.
//
Функция СформироватьДашбордОбучающегося(Знач Пользователь, Знач Период) Экспорт

    ПорогТета = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ПорогТетаДляПрохожденияТемы");
    Мета = ПолучитьМетаОбучающегося(Пользователь);

    Дашборд = Новый Структура;
    Дашборд.Вставить("Пользователь", Строка(Пользователь));
    Дашборд.Вставить("Группа",       Мета.Группа);
    Дашборд.Вставить("Курс",         Мета.Курс);
    Дашборд.Вставить("ПорогТета",    ПорогТета);
    Дашборд.Вставить("Период",       Новый Структура("Начало, Окончание", Период.Начало, Период.Окончание));
    Дашборд.Вставить("KPI",          СформироватьKPIОбучающегося(Пользователь, Мета));
    Дашборд.Вставить("Прогресс",     СформироватьПрогрессПоТемам(Пользователь));
    Дашборд.Вставить("Рекомендация", СформироватьРекомендацию(Пользователь, Мета.КурсСсылка));
    // Активность - всегда последние 14 дней (карточка так и подписана),
    // независимо от общего периода аналитики дашборда.
    ТекущийДень = НачалоДня(ОбщегоНазначенияСерверПриложение.ТекущаяДатаПриложения());
    Период14 = Новый Структура("Начало, Окончание", ТекущийДень - 13 * 86400, КонецДня(ТекущийДень));
    Дашборд.Вставить("Активность",   СформироватьИсториюБаллов(Пользователь, Период14));
    Дашборд.Вставить("РейтингГруппы", СформироватьРейтингГруппыДляСтудента(Мета.ГруппаСсылка, Пользователь));
    Дашборд.Вставить("Бейджи",        СформироватьГалереюБейджей(Пользователь));
    Дашборд.Вставить("ДинамикаТета",  СформироватьДинамикуТета(Пользователь));
    Дашборд.Вставить("Материалы",     СформироватьМатериалыБиблиотеки(Мета.КурсСсылка));
    Дашборд.Вставить("ВсеБейджи",      СформироватьВсеБейджи(Пользователь));
    Дашборд.Вставить("МетрикиБейджей", Геймификация.МетрикиОбучающегося(Пользователь));
    Дашборд.Вставить("ПользовательИД", Строка(Пользователь.УникальныйИдентификатор()));
    // Запуск теста допустим только в собственном дашборде. Когда преподаватель
    // открывает дашборд студента, флаг = Ложь - кнопки старта теста скрываются.
    Дашборд.Вставить("МожноНачинатьТест",
        Пользователь = ОбслуживаниеПользователейВызовСервера.ТекущийПользователь());
    Возврат ОбщегоНазначенияСерверПриложение.СериализоватьВJSON(Дашборд);

КонецФункции

// Формирует JSON-данные для дашборда преподавателя по учебной группе:
// распределение θ, тепловая карта, активность, рейтинг.
//
// Параметры:
//  УчебнаяГруппа - СправочникСсылка.УчебныеГруппы - учебная группа.
//  Период        - Структура - Начало (Дата), Окончание (Дата) — период аналитики.
//
// Возвращаемое значение:
//  Строка - JSON-представление данных дашборда.
//
Функция СформироватьДашбордПреподавателя(Знач УчебнаяГруппа, Знач Период) Экспорт

    ПорогТета = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ПорогТетаДляПрохожденияТемы");
    Мета = ПолучитьМетаГруппы(УчебнаяГруппа);

    Дашборд = Новый Структура;
    Дашборд.Вставить("Группа",         Мета.Наименование);
    Дашборд.Вставить("Преподаватель",  Мета.Преподаватель);
    Дашборд.Вставить("ЧислоСтудентов", Мета.ЧислоСтудентов);
    Дашборд.Вставить("ПорогТета",      ПорогТета);
    Дашборд.Вставить("Период", Новый Структура("Начало, Окончание", Период.Начало, Период.Окончание));
    Дашборд.Вставить("РаспределениеТета", СформироватьРаспределениеТета(УчебнаяГруппа));
    Дашборд.Вставить("ТепловаяКарта",     СформироватьТепловуюКартуТем(УчебнаяГруппа));
    Дашборд.Вставить("РейтингГруппы",     СформироватьРейтингГруппы(УчебнаяГруппа));
    Дашборд.Вставить("Активность",        СформироватьАктивность(УчебнаяГруппа, Период));
    Дашборд.Вставить("АктивныеСтуденты",  СформироватьАктивныхСтудентов(УчебнаяГруппа, Период));
    Дашборд.Вставить("KPI",               СформироватьKPIГруппы(УчебнаяГруппа, ПорогТета));
    Дашборд.Вставить("СтудентыРиска",     СформироватьСтудентовРиска(УчебнаяГруппа, ПорогТета));
    Возврат ОбщегоНазначенияСерверПриложение.СериализоватьВJSON(Дашборд);

КонецФункции

// Формирует JSON-данные для дашборда встроенной библиотеки учебных материалов:
// издания, сгруппированные по темам, с библиографическим описанием.
//
// Возвращаемое значение:
//  Строка - JSON-представление данных дашборда библиотеки.
//
Функция СформироватьДашбордБиблиотеки() Экспорт

    Дашборд = Новый Структура;
    Дашборд.Вставить("Заголовок", "Встроенная библиотека учебных материалов по «1С:Предприятие 8.3»");

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Привязки.Тема                          КАК Тема,
        |   Привязки.Тема.ПорядокИзучения          КАК Порядок,
        |   Привязки.Ссылка                        КАК Материал,
        |   Привязки.Ссылка.Наименование           КАК Название,
        |   Привязки.Ссылка.Автор                  КАК Автор,
        |   Привязки.Ссылка.ВидМатериала           КАК Вид,
        |   Привязки.Ссылка.ГодИздания             КАК Год,
        |   Привязки.Ссылка.Издательство           КАК Издательство,
        |   Привязки.Ссылка.ISBN                   КАК ISBN,
        |   Привязки.Ссылка.БиблиографическоеОписание КАК Библиография,
        |   Привязки.Ссылка.КраткоеОписание        КАК Описание,
        |   Привязки.Ссылка.КлючевыеСлова          КАК КлючевыеСлова,
        |   Привязки.Приоритет                     КАК Приоритет
        |ИЗ
        |   Справочник.МатериалыБиблиотеки.ПривязкиКТемам КАК Привязки
        |ГДЕ НЕ Привязки.Ссылка.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО Порядок, Тема, Приоритет, Название");
    Выборка = Запрос.Выполнить().Выбрать();

    Группы       = Новый Массив;
    ТекущаяТема  = Неопределено;
    ТекущаяГруппа = Неопределено;
    Всего = 0;
    Пока Выборка.Следующий() Цикл
        Если Выборка.Тема <> ТекущаяТема Тогда
            ТекущаяГруппа = Новый Структура("Тема, Материалы", Строка(Выборка.Тема), Новый Массив);
            Группы.Добавить(ТекущаяГруппа);
            ТекущаяТема = Выборка.Тема;
        КонецЕсли;
        Материал = Новый Структура;
        Материал.Вставить("Название",      Строка(Выборка.Название));
        Материал.Вставить("Автор",         ?(Выборка.Автор = Null, "", Выборка.Автор));
        Материал.Вставить("Вид",           Строка(Выборка.Вид));
        Материал.Вставить("Год",           ?(Выборка.Год = Null, 0, Выборка.Год));
        Материал.Вставить("Издательство",  ?(Выборка.Издательство = Null, "", Выборка.Издательство));
        Материал.Вставить("ISBN",          ?(Выборка.ISBN = Null, "", Выборка.ISBN));
        Материал.Вставить("Библиография",  ?(Выборка.Библиография = Null, "", Выборка.Библиография));
        Материал.Вставить("Описание",      ?(Выборка.Описание = Null, "", Выборка.Описание));
        Материал.Вставить("КлючевыеСлова", ?(Выборка.КлючевыеСлова = Null, "", Выборка.КлючевыеСлова));
        Материал.Вставить("Тема",          Строка(Выборка.Тема));
        Материал.Вставить("МатериалИД",    Строка(Выборка.Материал.УникальныйИдентификатор()));
        ТекущаяГруппа.Материалы.Добавить(Материал);
        Всего = Всего + 1;
    КонецЦикла;

    Дашборд.Вставить("ВсегоМатериалов", Всего);
    Дашборд.Вставить("Группы",          Группы);
    Возврат ОбщегоНазначенияСерверПриложение.СериализоватьВJSON(Дашборд);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Метаданные обучающегося: группа (ссылка/имя/размер) и курс (ссылка/имя).
Функция ПолучитьМетаОбучающегося(Знач Пользователь)

    Результат = Новый Структура;
    Результат.Вставить("Группа",       "");
    Результат.Вставить("ГруппаСсылка", Справочники.УчебныеГруппы.ПустаяСсылка());
    Результат.Вставить("ЧислоВГруппе", 0);
    Результат.Вставить("Курс",         "");
    Результат.Вставить("КурсСсылка",   Справочники.Курсы.ПустаяСсылка());

    Запрос = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |   Состав.Ссылка КАК Группа,
        |   Состав.Ссылка.Наименование КАК ИмяГруппы
        |ИЗ Справочник.УчебныеГруппы.Состав КАК Состав
        |ГДЕ Состав.Пользователь = &Пользователь");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Результат.ГруппаСсылка = Выборка.Группа;
        Результат.Группа       = Выборка.ИмяГруппы;
    КонецЕсли;

    Если ЗначениеЗаполнено(Результат.ГруппаСсылка) Тогда
        ЗапросК = Новый Запрос(
            "ВЫБРАТЬ КОЛИЧЕСТВО(Состав.Пользователь) КАК Кол
            |ИЗ Справочник.УчебныеГруппы.Состав КАК Состав
            |ГДЕ Состав.Ссылка = &Группа");
        ЗапросК.УстановитьПараметр("Группа", Результат.ГруппаСсылка);
        ВыборкаК = ЗапросК.Выполнить().Выбрать();
        Если ВыборкаК.Следующий() Тогда
            Результат.ЧислоВГруппе = ВыборкаК.Кол;
        КонецЕсли;
    КонецЕсли;

    // Курс — владелец тем, по которым у пользователя есть оценки; иначе первый курс.
    ЗапросКурс = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |   Оценки.Тема.Владелец КАК Курс,
        |   Оценки.Тема.Владелец.Наименование КАК ИмяКурса
        |ИЗ РегистрСведений.ОценкиПодготовленностиПоТемам КАК Оценки
        |ГДЕ Оценки.Пользователь = &Пользователь И Оценки.Тема.Владелец ЕСТЬ НЕ NULL");
    ЗапросКурс.УстановитьПараметр("Пользователь", Пользователь);
    ВыборкаКурс = ЗапросКурс.Выполнить().Выбрать();
    Если ВыборкаКурс.Следующий() Тогда
        Результат.КурсСсылка = ВыборкаКурс.Курс;
        Результат.Курс       = ВыборкаКурс.ИмяКурса;
    Иначе
        ЗапросПК = Новый Запрос(
            "ВЫБРАТЬ ПЕРВЫЕ 1 Курсы.Ссылка КАК Ссылка, Курсы.Наименование КАК Имя
            |ИЗ Справочник.Курсы КАК Курсы ГДЕ НЕ Курсы.ПометкаУдаления");
        ВыборкаПК = ЗапросПК.Выполнить().Выбрать();
        Если ВыборкаПК.Следующий() Тогда
            Результат.КурсСсылка = ВыборкаПК.Ссылка;
            Результат.Курс       = ВыборкаПК.Имя;
        КонецЕсли;
    КонецЕсли;

    Возврат Результат;

КонецФункции

// KPI обучающегося: XP (всего и за неделю), бейджи (получено/всего/новых),
// позиция в рейтинге и её изменение, серия активных дней (streak).
Функция СформироватьKPIОбучающегося(Знач Пользователь, Знач Мета)

    KPI = Новый Структура;
    KPI.Вставить("XPВсего",          0);
    KPI.Вставить("XPЗаНеделю",       0);
    KPI.Вставить("БейджейПолучено",  0);
    KPI.Вставить("БейджейВсего",     0);
    KPI.Вставить("БейджейНовых",     0);
    KPI.Вставить("Позиция",          0);
    KPI.Вставить("ПозицияИзменение", 0);
    KPI.Вставить("РазмерГруппы",     Мета.ЧислоВГруппе);
    KPI.Вставить("StreakТекущий",    0);
    KPI.Вставить("StreakЛучший",     0);

    НеделяНазад = ОбщегоНазначенияСерверПриложение.ТекущаяДатаПриложения() - 7 * 86400;

    Запрос = Новый Запрос(
        "ВЫБРАТЬ ЕСТЬNULL(СУММА(Об.КоличествоОборот), 0) КАК Всего
        |ИЗ РегистрНакопления.БаллыОпыта.Обороты(, , , Пользователь = &Пользователь) КАК Об");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        KPI.XPВсего = Выборка.Всего;
    КонецЕсли;

    Запрос = Новый Запрос(
        "ВЫБРАТЬ ЕСТЬNULL(СУММА(Об.КоличествоОборот), 0) КАК ЗаНеделю
        |ИЗ РегистрНакопления.БаллыОпыта.Обороты(&Начало, , , Пользователь = &Пользователь) КАК Об");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Начало", НеделяНазад);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        KPI.XPЗаНеделю = Выборка.ЗаНеделю;
    КонецЕсли;

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   КОЛИЧЕСТВО(ВБ.Ссылка) КАК Кол,
        |   СУММА(ВЫБОР КОГДА ВБ.ДатаВыдачи >= &Начало ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК Новых
        |ИЗ Документ.ВыдачаБейджа КАК ВБ
        |ГДЕ ВБ.Обучающийся = &Пользователь И НЕ ВБ.ПометкаУдаления");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Начало", НеделяНазад);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        KPI.БейджейПолучено = ?(Выборка.Кол = Null, 0, Выборка.Кол);
        KPI.БейджейНовых    = ?(Выборка.Новых = Null, 0, Выборка.Новых);
    КонецЕсли;

    Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(Бейджи.Ссылка) КАК Кол ИЗ Справочник.Бейджи КАК Бейджи ГДЕ НЕ Бейджи.ПометкаУдаления");
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        KPI.БейджейВсего = Выборка.Кол;
    КонецЕсли;

    // Позиция и её изменение — два последних среза рейтинга.
    Запрос = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 2 РП.Период КАК Период, РП.Ранг КАК Ранг
        |ИЗ РегистрСведений.РейтинговыеПозиции КАК РП
        |ГДЕ РП.Пользователь = &Пользователь
        |УПОРЯДОЧИТЬ ПО РП.Период УБЫВ");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Выборка = Запрос.Выполнить().Выбрать();
    Ранги = Новый Массив;
    Пока Выборка.Следующий() Цикл
        Ранги.Добавить(Выборка.Ранг);
    КонецЦикла;
    Если Ранги.Количество() >= 1 Тогда
        KPI.Позиция = Ранги[0];
    КонецЕсли;
    Если Ранги.Количество() >= 2 Тогда
        KPI.ПозицияИзменение = Ранги[1] - Ранги[0]; // > 0 — поднялся в рейтинге
    КонецЕсли;

    Streak = ПолучитьStreak(Пользователь);
    KPI.StreakТекущий = Streak.Текущий;
    KPI.StreakЛучший  = Streak.Лучший;

    Возврат KPI;

КонецФункции

// Серия активных дней: текущая (если последний активный день — сегодня/вчера) и лучшая.
Функция ПолучитьStreak(Знач Пользователь)

    Результат = Новый Структура("Текущий, Лучший", 0, 0);

    Запрос = Новый Запрос(
        "ВЫБРАТЬ РАЗЛИЧНЫЕ НАЧАЛОПЕРИОДА(СА.Период, ДЕНЬ) КАК День
        |ИЗ РегистрСведений.СобытияАналитики КАК СА
        |ГДЕ СА.Пользователь = &Пользователь
        |УПОРЯДОЧИТЬ ПО День");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Выборка = Запрос.Выполнить().Выбрать();
    Дни = Новый Массив;
    Пока Выборка.Следующий() Цикл
        Дни.Добавить(НачалоДня(Выборка.День));
    КонецЦикла;
    Если Дни.Количество() = 0 Тогда
        Возврат Результат;
    КонецЕсли;

    Лучший  = 1;
    Текущая = 1;
    Для Индекс = 1 По Дни.Количество() - 1 Цикл
        Разница = (Дни[Индекс] - Дни[Индекс - 1]) / 86400;
        Если Разница = 1 Тогда
            Текущая = Текущая + 1;
        Иначе
            Текущая = 1;
        КонецЕсли;
        Если Текущая > Лучший Тогда
            Лучший = Текущая;
        КонецЕсли;
    КонецЦикла;

    Сегодня      = НачалоДня(ОбщегоНазначенияСерверПриложение.ТекущаяДатаПриложения());
    ПоследнийДень = Дни[Дни.Количество() - 1];
    Если (Сегодня - ПоследнийДень) / 86400 <= 1 Тогда
        Результат.Текущий = Текущая;
    КонецЕсли;
    Результат.Лучший = Лучший;
    Возврат Результат;

КонецФункции

// Рекомендация следующего шага: тема (с её θ) и приоритетный материал по теме.
Функция СформироватьРекомендацию(Знач Пользователь, Знач Курс)

    Рек = Новый Структура("Есть, Тема, Тета, Материал, Автор", Ложь, "", 0, "", "");
    Рек.Вставить("ТемаИД",     "");
    Рек.Вставить("МатериалИД", "");
    Если Не ЗначениеЗаполнено(Курс) Тогда
        Возврат Рек;
    КонецЕсли;

    ТемаСсылка = ТраекторияОбучения.РекомендоватьСледующуюТему(Пользователь, Курс);
    Если Не ЗначениеЗаполнено(ТемаСсылка) Тогда
        Возврат Рек;
    КонецЕсли;
    Рек.Есть   = Истина;
    Рек.Тема   = Строка(ТемаСсылка);
    Рек.ТемаИД = Строка(ТемаСсылка.УникальныйИдентификатор());

    Запрос = Новый Запрос(
        "ВЫБРАТЬ ЕСТЬNULL(СрезПоследних.Тета, 0) КАК Тета
        |ИЗ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних(, Пользователь = &Пользователь И Тема = &Тема) КАК СрезПоследних");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    Запрос.УстановитьПараметр("Тема",         ТемаСсылка);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Рек.Тета = Окр(Выборка.Тета, 2);
    КонецЕсли;

    ЗапросМ = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |   Привязки.Ссылка              КАК Ссылка,
        |   Привязки.Ссылка.Наименование КАК Имя,
        |   Привязки.Ссылка.Автор        КАК Автор
        |ИЗ Справочник.МатериалыБиблиотеки.ПривязкиКТемам КАК Привязки
        |ГДЕ Привязки.Тема = &Тема И НЕ Привязки.Ссылка.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО Привязки.Приоритет");
    ЗапросМ.УстановитьПараметр("Тема", ТемаСсылка);
    ВыборкаМ = ЗапросМ.Выполнить().Выбрать();
    Если ВыборкаМ.Следующий() Тогда
        Рек.Материал   = ВыборкаМ.Имя;
        Рек.Автор      = ?(ВыборкаМ.Автор = Null, "", ВыборкаМ.Автор);
        Рек.МатериалИД = Строка(ВыборкаМ.Ссылка.УникальныйИдентификатор());
    КонецЕсли;

    Возврат Рек;

КонецФункции

// Рейтинг группы для дашборда студента: с недельным приростом XP и флагом «свой».
Функция СформироватьРейтингГруппыДляСтудента(Знач Группа, Знач Пользователь)

    Если Не ЗначениеЗаполнено(Группа) Тогда
        Возврат Новый Массив;
    КонецЕсли;

    НеделяНазад = ОбщегоНазначенияСерверПриложение.ТекущаяДатаПриложения() - 7 * 86400;

    ЗапросП = Новый Запрос(
        "ВЫБРАТЬ
        |   Об.Пользователь          КАК Пользователь,
        |   СУММА(Об.КоличествоОборот) КАК Прирост
        |ИЗ РегистрНакопления.БаллыОпыта.Обороты(&Начало, , , ) КАК Об
        |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчебныеГруппы.Состав КАК Состав
        |       ПО Состав.Пользователь = Об.Пользователь
        |ГДЕ Состав.Ссылка = &Группа
        |СГРУППИРОВАТЬ ПО Об.Пользователь");
    ЗапросП.УстановитьПараметр("Группа", Группа);
    ЗапросП.УстановитьПараметр("Начало", НеделяНазад);
    ВыборкаП = ЗапросП.Выполнить().Выбрать();
    ПриростПоПольз = Новый Соответствие;
    Пока ВыборкаП.Следующий() Цикл
        ПриростПоПольз.Вставить(ВыборкаП.Пользователь, ВыборкаП.Прирост);
    КонецЦикла;

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   СрезПоследних.Пользователь КАК Пользователь,
        |   СрезПоследних.СуммаБаллов  КАК СуммаБаллов,
        |   СрезПоследних.Ранг         КАК Ранг,
        |   СрезПоследних.СредняяТета  КАК СредняяТета
        |ИЗ РегистрСведений.РейтинговыеПозиции.СрезПоследних(, УчебнаяГруппа = &Группа) КАК СрезПоследних
        |УПОРЯДОЧИТЬ ПО Ранг");
    Запрос.УстановитьПараметр("Группа", Группа);
    Выборка = Запрос.Выполнить().Выбрать();
    Позиции = Новый Массив;
    Пока Выборка.Следующий() Цикл
        Прирост = ПриростПоПольз.Получить(Выборка.Пользователь);
        Поз = Новый Структура;
        Поз.Вставить("Пользователь", Строка(Выборка.Пользователь));
        Поз.Вставить("СуммаБаллов",  Выборка.СуммаБаллов);
        Поз.Вставить("Ранг",         Выборка.Ранг);
        Поз.Вставить("СредняяТета",  Выборка.СредняяТета);
        Поз.Вставить("Прирост",      ?(Прирост = Неопределено, 0, Прирост));
        Поз.Вставить("Свой",         Выборка.Пользователь = Пользователь);
        Позиции.Добавить(Поз);
    КонецЦикла;
    Возврат Позиции;

КонецФункции

Функция СформироватьИсториюБаллов(Знач Пользователь, Знач Период)
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Обороты.Период            КАК Период,
        |   Обороты.КоличествоОборот  КАК Количество
        |ИЗ
        |   РегистрНакопления.БаллыОпыта.Обороты(&НачалоПериода, &КонецПериода, День, Пользователь = &Пользователь) КАК Обороты
        |УПОРЯДОЧИТЬ ПО Период");
    Запрос.УстановитьПараметр("НачалоПериода", Период.Начало);
    Запрос.УстановитьПараметр("КонецПериода",  Период.Окончание);
    Запрос.УстановитьПараметр("Пользователь",  Пользователь);
    
    Точки = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Точки.Добавить(Новый Структура("Дата, Значение", Выборка.Период, Выборка.Количество));
    КонецЦикла;
    Возврат Точки;
    
КонецФункции

Функция СформироватьГалереюБейджей(Знач Пользователь)
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   ВыдачаБейджа.Бейдж                     КАК Бейдж,
        |   ВыдачаБейджа.ДатаВыдачи                КАК ДатаВыдачи,
        |   ВыдачаБейджа.Бейдж.Категория           КАК Категория,
        |   ВыдачаБейджа.Бейдж.Описание            КАК Описание
        |ИЗ Документ.ВыдачаБейджа КАК ВыдачаБейджа
        |ГДЕ ВыдачаБейджа.Обучающийся = &Пользователь И НЕ ВыдачаБейджа.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО ДатаВыдачи УБЫВ");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    
    Бейджи = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Бейдж = Новый Структура;
        Бейдж.Вставить("Название",  Строка(Выборка.Бейдж));
        Бейдж.Вставить("Категория", Строка(Выборка.Категория));
        Бейдж.Вставить("Описание",  Выборка.Описание);
        Бейдж.Вставить("ДатаВыдачи", Выборка.ДатаВыдачи);
        Бейджи.Добавить(Бейдж);
    КонецЦикла;
    Возврат Бейджи;

КонецФункции

// Каталог всех бейджей с условиями получения и отметкой о выдаче пользователю
// (для страницы "Все бейджи"). Возвращает массив структур: Название, Категория,
// Описание, НаградаXP, Получен (Булево), ДатаПолучения, Условия (массив {Тип, Порог}).
Функция СформироватьВсеБейджи(Знач Пользователь)

    // Уже выданные бейджи пользователя -> дата первой выдачи.
    ЗапросВыдан = Новый Запрос(
        "ВЫБРАТЬ
        |   ВыдачаБейджа.Бейдж            КАК Бейдж,
        |   МИНИМУМ(ВыдачаБейджа.ДатаВыдачи) КАК ДатаВыдачи
        |ИЗ Документ.ВыдачаБейджа КАК ВыдачаБейджа
        |ГДЕ ВыдачаБейджа.Обучающийся = &Пользователь И НЕ ВыдачаБейджа.ПометкаУдаления
        |СГРУППИРОВАТЬ ПО ВыдачаБейджа.Бейдж");
    ЗапросВыдан.УстановитьПараметр("Пользователь", Пользователь);
    ВыборкаВыдан = ЗапросВыдан.Выполнить().Выбрать();
    ДатаВыдачиПоБейджу = Новый Соответствие;
    Пока ВыборкаВыдан.Следующий() Цикл
        ДатаВыдачиПоБейджу.Вставить(ВыборкаВыдан.Бейдж, ВыборкаВыдан.ДатаВыдачи);
    КонецЦикла;

    // Все бейджи + их условия активации одним запросом (упорядочены по категории/имени).
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Бейджи.Ссылка             КАК Бейдж,
        |   Бейджи.Наименование       КАК Наименование,
        |   Бейджи.Категория          КАК Категория,
        |   Бейджи.Описание           КАК Описание,
        |   Бейджи.БаллыЗаПолучение   КАК НаградаXP,
        |   Условия.ТипУсловия        КАК ТипУсловия,
        |   Условия.ПороговоеЗначение КАК Порог,
        |   Условия.НомерСтроки       КАК НомерСтроки
        |ИЗ Справочник.Бейджи КАК Бейджи
        |   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Бейджи.УсловияАктивации КАК Условия
        |       ПО Условия.Ссылка = Бейджи.Ссылка
        |ГДЕ НЕ Бейджи.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО Бейджи.Категория, Бейджи.Наименование, Условия.НомерСтроки");
    Выборка = Запрос.Выполнить().Выбрать();

    Бейджи   = Новый Массив;
    ПоСсылке = Новый Соответствие; // Бейдж -> Структура
    Пока Выборка.Следующий() Цикл
        Запись = ПоСсылке.Получить(Выборка.Бейдж);
        Если Запись = Неопределено Тогда
            Дата = ДатаВыдачиПоБейджу.Получить(Выборка.Бейдж);
            Запись = Новый Структура;
            Запись.Вставить("Название",      Строка(Выборка.Наименование));
            Запись.Вставить("Категория",     Строка(Выборка.Категория));
            Запись.Вставить("Описание",      Выборка.Описание);
            Запись.Вставить("НаградаXP",     Выборка.НаградаXP);
            Запись.Вставить("Получен",       Дата <> Неопределено);
            Запись.Вставить("ДатаПолучения", ?(Дата = Неопределено, "", Дата));
            Запись.Вставить("Условия",       Новый Массив);
            Бейджи.Добавить(Запись);
            ПоСсылке.Вставить(Выборка.Бейдж, Запись);
        КонецЕсли;
        Если ЗначениеЗаполнено(Выборка.ТипУсловия) Тогда
            Запись.Условия.Добавить(Новый Структура("Тип, Порог",
                Строка(Выборка.ТипУсловия), Выборка.Порог));
        КонецЕсли;
    КонецЦикла;
    Возврат Бейджи;

КонецФункции

// Список материалов библиотеки по темам курса (для блока "Материалы" дашборда).
// Возвращает массив структур: Название, Автор, Вид, Тема, МатериалИД, ТемаИД, Приоритет.
Функция СформироватьМатериалыБиблиотеки(Знач Курс)

    Если Не ЗначениеЗаполнено(Курс) Тогда
        Возврат Новый Массив;
    КонецЕсли;

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Привязки.Ссылка               КАК Материал,
        |   Привязки.Ссылка.Наименование  КАК Наименование,
        |   Привязки.Ссылка.Автор         КАК Автор,
        |   Привязки.Ссылка.ВидМатериала  КАК Вид,
        |   Привязки.Тема                 КАК Тема,
        |   Привязки.Приоритет            КАК Приоритет
        |ИЗ Справочник.МатериалыБиблиотеки.ПривязкиКТемам КАК Привязки
        |ГДЕ Привязки.Тема.Владелец = &Курс И НЕ Привязки.Ссылка.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО Привязки.Тема.ПорядокИзучения, Приоритет");
    Запрос.УстановитьПараметр("Курс", Курс);

    Материалы = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Материал = Новый Структура;
        Материал.Вставить("Название",   Строка(Выборка.Наименование));
        Материал.Вставить("Автор",      ?(Выборка.Автор = Null, "", Выборка.Автор));
        Материал.Вставить("Вид",        Строка(Выборка.Вид));
        Материал.Вставить("Тема",       Строка(Выборка.Тема));
        Материал.Вставить("МатериалИД", Строка(Выборка.Материал.УникальныйИдентификатор()));
        Материал.Вставить("ТемаИД",     Строка(Выборка.Тема.УникальныйИдентификатор()));
        Материал.Вставить("Приоритет",  Выборка.Приоритет);
        Материалы.Добавить(Материал);
    КонецЦикла;
    Возврат Материалы;

КонецФункции

Функция СформироватьПрогрессПоТемам(Знач Пользователь)
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Темы.Ссылка                       КАК Тема,
        |   ЕСТЬNULL(СрезПоследних.Тета, -99) КАК Тета
        |ИЗ
        |   Справочник.Темы КАК Темы
        |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних(, Пользователь = &Пользователь) КАК СрезПоследних
        |       ПО СрезПоследних.Тема = Темы.Ссылка
        |УПОРЯДОЧИТЬ ПО Темы.ПорядокИзучения");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);
    
    Темы = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Темы.Добавить(Новый Структура("Тема, Тета, ТемаИД",
            Строка(Выборка.Тема), Выборка.Тета, Строка(Выборка.Тема.УникальныйИдентификатор())));
    КонецЦикла;
    Возврат Темы;
    
КонецФункции

// Все оценки θ пользователя по темам, по датам сдач (для графика "Динамика θ").
// Период намеренно НЕ фильтруется: иначе тема, сданная вне окна дашборда, молча
// пропадала бы с графика, хотя в "Прогрессе" (срез последних) она видна - именно
// из-за этого расхождения часть тем не отображалась. Дата округляется до дня:
// сдачи одного дня встают в одну точку оси X (без дублей подписей), а повторные
// сдачи темы в разные дни дают линию роста.
Функция СформироватьДинамикуТета(Знач Пользователь)

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   НАЧАЛОПЕРИОДА(Оценки.Период, ДЕНЬ) КАК Дата,
        |   Оценки.Тема   КАК Тема,
        |   Оценки.Тета   КАК Тета,
        |   Оценки.Период КАК Момент
        |ИЗ
        |   РегистрСведений.ОценкиПодготовленностиПоТемам КАК Оценки
        |ГДЕ
        |   Оценки.Пользователь = &Пользователь
        |УПОРЯДОЧИТЬ ПО Момент");
    Запрос.УстановитьПараметр("Пользователь", Пользователь);

    Точки = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Точки.Добавить(Новый Структура("Дата, Тема, Тета",
            Выборка.Дата, Строка(Выборка.Тема), Выборка.Тета));
    КонецЦикла;
    Возврат Точки;

КонецФункции

Функция СформироватьРаспределениеТета(Знач УчебнаяГруппа)
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   СП.Тема          КАК Тема,
        |   СП.Тета          КАК Тета
        |ИЗ
        |   Справочник.УчебныеГруппы.Состав КАК Группа
        |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних КАК СП
        |       ПО СП.Пользователь = Группа.Пользователь
        |ГДЕ Группа.Ссылка = &Группа");
    Запрос.УстановитьПараметр("Группа", УчебнаяГруппа);
    
    Записи = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Записи.Добавить(Новый Структура("Тема, Тета",
            Строка(Выборка.Тема), Выборка.Тета));
    КонецЦикла;
    Возврат Записи;
    
КонецФункции

Функция СформироватьТепловуюКартуТем(Знач УчебнаяГруппа)
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Группа.Пользователь  КАК Пользователь,
        |   СП.Тема              КАК Тема,
        |   СП.Тета              КАК Тета
        |ИЗ
        |   Справочник.УчебныеГруппы.Состав КАК Группа
        |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних КАК СП
        |       ПО СП.Пользователь = Группа.Пользователь
        |ГДЕ Группа.Ссылка = &Группа");
    Запрос.УстановитьПараметр("Группа", УчебнаяГруппа);
    
    Ячейки = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        ПредставлениеТемы = "";
        Если Выборка.Тема <> Null Тогда
            ПредставлениеТемы = Строка(Выборка.Тема);
        КонецЕсли;
        ЗначениеТета = 0;
        Если Выборка.Тета <> Null Тогда
            ЗначениеТета = Выборка.Тета;
        КонецЕсли;
        ИДТемы = ?(Выборка.Тема <> Null, Строка(Выборка.Тема.УникальныйИдентификатор()), "");
        Ячейки.Добавить(Новый Структура("Пользователь, Тема, Тета, ПользовательИД, ТемаИД",
            Выборка.Пользователь.Наименование, ПредставлениеТемы, ЗначениеТета,
            Строка(Выборка.Пользователь.УникальныйИдентификатор()), ИДТемы));
    КонецЦикла;
    Возврат Ячейки;
    
КонецФункции

Функция СформироватьРейтингГруппы(Знач УчебнаяГруппа)
    
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   СрезПоследних.Пользователь КАК Пользователь,
        |   СрезПоследних.СуммаБаллов  КАК СуммаБаллов,
        |   СрезПоследних.Ранг         КАК Ранг,
        |   СрезПоследних.СредняяТета  КАК СредняяТета
        |ИЗ
        |   РегистрСведений.РейтинговыеПозиции.СрезПоследних(, УчебнаяГруппа = &Группа) КАК СрезПоследних
        |УПОРЯДОЧИТЬ ПО Ранг");
    Запрос.УстановитьПараметр("Группа", УчебнаяГруппа);
    
    Позиции = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Позиция = Новый Структура;
        Позиция.Вставить("Пользователь",   Выборка.Пользователь.Наименование);
        Позиция.Вставить("ПользовательИД", Строка(Выборка.Пользователь.УникальныйИдентификатор()));
        Позиция.Вставить("СуммаБаллов",  Выборка.СуммаБаллов);
        Позиция.Вставить("Ранг",         Выборка.Ранг);
        Позиция.Вставить("СредняяТета",  Выборка.СредняяТета);
        Позиции.Добавить(Позиция);
    КонецЦикла;
    Возврат Позиции;
    
КонецФункции

Функция СформироватьАктивность(Знач УчебнаяГруппа, Знач Период)
    
    // Группировка событий по дню и типу
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   НАЧАЛОПЕРИОДА(СА.Период, ДЕНЬ) КАК День,
        |   СА.ТипСобытия                       КАК Тип,
        |   КОЛИЧЕСТВО(*)                       КАК Кол
        |ИЗ РегистрСведений.СобытияАналитики КАК СА
        |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчебныеГруппы.Состав КАК Группа
        |       ПО Группа.Пользователь = СА.Пользователь
        |ГДЕ Группа.Ссылка = &Группа И СА.Период МЕЖДУ &Начало И &Окончание
        |СГРУППИРОВАТЬ ПО НАЧАЛОПЕРИОДА(СА.Период, ДЕНЬ), СА.ТипСобытия
        |УПОРЯДОЧИТЬ ПО День, Тип");
    Запрос.УстановитьПараметр("Группа",   УчебнаяГруппа);
    Запрос.УстановитьПараметр("Начало",    Период.Начало);
    Запрос.УстановитьПараметр("Окончание", Период.Окончание);
    
    Точки = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Точки.Добавить(Новый Структура("День, Тип, Кол",
            Выборка.День, Строка(Выборка.Тип), Выборка.Кол));
    КонецЦикла;
    Возврат Точки;

КонецФункции

// Метаданные группы: наименование, ФИО преподавателя, число студентов.
Функция ПолучитьМетаГруппы(Знач УчебнаяГруппа)

    Результат = Новый Структура("Наименование, Преподаватель, ЧислоСтудентов", "", "", 0);
	
	Результат.Наименование = УчебнаяГруппа.Наименование;
	Результат.Преподаватель = УчебнаяГруппа.Преподаватель.Наименование;
	Результат.ЧислоСтудентов = УчебнаяГруппа.Состав.Количество();
	
	//Запрос = Новый Запрос(
	//    "ВЫБРАТЬ
	//    |   Группа.Наименование  КАК Наименование,
	//    |   Группа.Преподаватель КАК Преподаватель,
	//    |   КОЛИЧЕСТВО(Состав.Пользователь) КАК ЧислоСтудентов
	//    |ИЗ
	//    |   Справочник.УчебныеГруппы КАК Группа
	//    |   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеГруппы.Состав КАК Состав
	//    |       ПО Состав.Ссылка = Группа.Ссылка
	//    |ГДЕ Группа.Ссылка = &Группа
	//    |СГРУППИРОВАТЬ ПО Группа.Наименование, Группа.Преподаватель");
	//Запрос.УстановитьПараметр("Группа", УчебнаяГруппа);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//    Результат.Наименование   = Выборка.Наименование;
	//    Результат.Преподаватель  = Строка(Выборка.Преподаватель);
	//    Результат.ЧислоСтудентов = Выборка.ЧислоСтудентов;
	//КонецЕсли;
    Возврат Результат;

КонецФункции

// Ключевые показатели группы: средняя θ, освоено тем (в среднем) из общего числа,
// число завершённых тестов (всего и за неделю), число студентов в зоне риска.
Функция СформироватьKPIГруппы(Знач УчебнаяГруппа, Знач ПорогТета)

    KPI = Новый Структура;
    KPI.Вставить("СредняяТета",           0);
    KPI.Вставить("ОсвоеноТемВСреднем",    0);
    KPI.Вставить("ЧислоТемВсего",         0);
    KPI.Вставить("ЗавершённыхТестов",     0);
    KPI.Вставить("ЗавершённыхЗаНеделю",   0);
    KPI.Вставить("ВЗонеРиска",            0);

    // Средняя θ по группе (по актуальным оценкам).
    Запрос = Новый Запрос(
        "ВЫБРАТЬ ЕСТЬNULL(СРЕДНЕЕ(СП.Тета), 0) КАК Среднее
        |ИЗ
        |   Справочник.УчебныеГруппы.Состав КАК Состав
        |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних КАК СП
        |       ПО СП.Пользователь = Состав.Пользователь
        |ГДЕ Состав.Ссылка = &Группа");
    Запрос.УстановитьПараметр("Группа", УчебнаяГруппа);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        KPI.СредняяТета = Окр(Выборка.Среднее, 2);
    КонецЕсли;

    // Освоено тем (в среднем) — число тем с θ ≥ порога на студента.
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Состав.Пользователь КАК Пользователь,
        |   СУММА(ВЫБОР КОГДА СП.Тета >= &Порог ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК Освоено
        |ИЗ
        |   Справочник.УчебныеГруппы.Состав КАК Состав
        |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних КАК СП
        |       ПО СП.Пользователь = Состав.Пользователь
        |ГДЕ Состав.Ссылка = &Группа
        |СГРУППИРОВАТЬ ПО Состав.Пользователь");
    Запрос.УстановитьПараметр("Группа", УчебнаяГруппа);
    Запрос.УстановитьПараметр("Порог",  ПорогТета);
    Выборка = Запрос.Выполнить().Выбрать();
    СуммаОсвоено = 0;
    ЧислоСтудентов = 0;
    Пока Выборка.Следующий() Цикл
        СуммаОсвоено = СуммаОсвоено + Выборка.Освоено;
        ЧислоСтудентов = ЧислоСтудентов + 1;
    КонецЦикла;
    Если ЧислоСтудентов > 0 Тогда
        KPI.ОсвоеноТемВСреднем = Окр(СуммаОсвоено / ЧислоСтудентов, 1);
    КонецЕсли;

    Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(Темы.Ссылка) КАК Кол ИЗ Справочник.Темы КАК Темы ГДЕ НЕ Темы.ПометкаУдаления");
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        KPI.ЧислоТемВсего = Выборка.Кол;
    КонецЕсли;

    // Завершённые тесты — всего и за последнюю неделю.
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   КОЛИЧЕСТВО(ПТ.Ссылка) КАК Всего,
        |   СУММА(ВЫБОР КОГДА ПТ.ДатаОкончания >= &НеделяНазад ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) КАК ЗаНеделю
        |ИЗ
        |   Документ.ПопыткаТеста КАК ПТ
        |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчебныеГруппы.Состав КАК Состав
        |       ПО Состав.Пользователь = ПТ.Обучающийся
        |ГДЕ Состав.Ссылка = &Группа И ПТ.СтатусСессии = ""Завершена"" И НЕ ПТ.ПометкаУдаления");
    Запрос.УстановитьПараметр("Группа", УчебнаяГруппа);
    Запрос.УстановитьПараметр("НеделяНазад", ОбщегоНазначенияСерверПриложение.ТекущаяДатаПриложения() - 7 * 86400);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        KPI.ЗавершённыхТестов   = ?(Выборка.Всего = Null, 0, Выборка.Всего);
        KPI.ЗавершённыхЗаНеделю = ?(Выборка.ЗаНеделю = Null, 0, Выборка.ЗаНеделю);
    КонецЕсли;

    KPI.ВЗонеРиска = СформироватьСтудентовРиска(УчебнаяГруппа, ПорогТета).Количество();

    Возврат KPI;

КонецФункции

// Студенты в зоне риска: средняя θ < 0 ИЛИ простой > 7 дней без активности.
// Для каждого: средняя θ, дней простоя, слабые темы (θ < порога).
Функция СформироватьСтудентовРиска(Знач УчебнаяГруппа, Знач ПорогТета)

    // Средняя θ и слабые темы по студентам группы.
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Состав.Пользователь КАК Пользователь,
        |   СП.Тема            КАК Тема,
        |   СП.Тета            КАК Тета
        |ИЗ
        |   Справочник.УчебныеГруппы.Состав КАК Состав
        |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиПодготовленностиПоТемам.СрезПоследних КАК СП
        |       ПО СП.Пользователь = Состав.Пользователь
        |ГДЕ Состав.Ссылка = &Группа");
    Запрос.УстановитьПараметр("Группа", УчебнаяГруппа);
    Выборка = Запрос.Выполнить().Выбрать();

    ПоПользователю = Новый Соответствие; // Пользователь -> Структура(Сумма, Кол, СлабыеТемы)
    Пока Выборка.Следующий() Цикл
        Данные = ПоПользователю.Получить(Выборка.Пользователь);
        Если Данные = Неопределено Тогда
            Данные = Новый Структура("Сумма, Кол, Слабые", 0, 0, Новый Массив);
            ПоПользователю.Вставить(Выборка.Пользователь, Данные);
        КонецЕсли;
        Если Выборка.Тета <> Null Тогда
            Данные.Сумма = Данные.Сумма + Выборка.Тета;
            Данные.Кол   = Данные.Кол + 1;
            Если Выборка.Тета < ПорогТета И Данные.Слабые.Количество() < 3 Тогда
                Данные.Слабые.Добавить(Строка(Выборка.Тема));
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;

    // Дата последней активности по студентам.
    ЗапросАктивность = Новый Запрос(
        "ВЫБРАТЬ
        |   СА.Пользователь КАК Пользователь,
        |   МАКСИМУМ(СА.Период) КАК Последняя
        |ИЗ
        |   РегистрСведений.СобытияАналитики КАК СА
        |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчебныеГруппы.Состав КАК Состав
        |       ПО Состав.Пользователь = СА.Пользователь
        |ГДЕ Состав.Ссылка = &Группа
        |СГРУППИРОВАТЬ ПО СА.Пользователь");
    ЗапросАктивность.УстановитьПараметр("Группа", УчебнаяГруппа);
    ВыборкаА = ЗапросАктивность.Выполнить().Выбрать();
    ПоследняяАктивность = Новый Соответствие;
    Пока ВыборкаА.Следующий() Цикл
        ПоследняяАктивность.Вставить(ВыборкаА.Пользователь, ВыборкаА.Последняя);
    КонецЦикла;

    Сейчас = ОбщегоНазначенияСерверПриложение.ТекущаяДатаПриложения();
    Студенты = Новый Массив;
    Для Каждого Элемент Из ПоПользователю Цикл
        Данные = Элемент.Значение;
        СредняяТета = ?(Данные.Кол > 0, Данные.Сумма / Данные.Кол, 0);

        Последняя = ПоследняяАктивность.Получить(Элемент.Ключ);
        Если Последняя = Неопределено Тогда
            ДнейПростоя = 999;
        Иначе
            ДнейПростоя = Цел((Сейчас - Последняя) / 86400);
        КонецЕсли;

        Если СредняяТета < 0 ИЛИ ДнейПростоя > 7 Тогда
            Студент = Новый Структура;
            Студент.Вставить("Студент",        Строка(Элемент.Ключ));
            Студент.Вставить("ПользовательИД", Строка(Элемент.Ключ.УникальныйИдентификатор()));
            Студент.Вставить("СредняяТета", Окр(СредняяТета, 2));
            Студент.Вставить("ДнейПростоя", ДнейПростоя);
            Студент.Вставить("СлабыеТемы",  Данные.Слабые);
            Студенты.Добавить(Студент);
        КонецЕсли;
    КонецЦикла;
    Возврат Студенты;

КонецФункции

// Число уникальных активных студентов группы по дням за период.
Функция СформироватьАктивныхСтудентов(Знач УчебнаяГруппа, Знач Период)

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   НАЧАЛОПЕРИОДА(СА.Период, ДЕНЬ)        КАК День,
        |   КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СА.Пользователь) КАК Количество
        |ИЗ
        |   РегистрСведений.СобытияАналитики КАК СА
        |   ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчебныеГруппы.Состав КАК Состав
        |       ПО Состав.Пользователь = СА.Пользователь
        |ГДЕ Состав.Ссылка = &Группа И СА.Период МЕЖДУ &Начало И &Окончание
        |СГРУППИРОВАТЬ ПО НАЧАЛОПЕРИОДА(СА.Период, ДЕНЬ)
        |УПОРЯДОЧИТЬ ПО День");
    Запрос.УстановитьПараметр("Группа",    УчебнаяГруппа);
    Запрос.УстановитьПараметр("Начало",    Период.Начало);
    Запрос.УстановитьПараметр("Окончание", Период.Окончание);

    Точки = Новый Массив;
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Точки.Добавить(Новый Структура("День, Количество", Выборка.День, Выборка.Количество));
    КонецЦикла;
    Возврат Точки;

КонецФункции

#КонецОбласти
